# vstDrawCoordRect

```pascal
PROCEDURE vstDrawCoordRect(
				ptLeftTopX, ptLeftTopY : REAL;
				ptRghtBotX, ptRghtBotY : REAL);
```

```python
def vs.vstDrawCoordRect(ptLeftTopX, ptLeftTopY, ptRghtBotX, ptRghtBotY):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ptLeftTopX, ptLeftTopY|REAL|   |
|ptRghtBotX, ptRghtBotY|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events